benchmarks/flaskapp-c100-n1000.log
Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /api/pool
Document Length:        67 bytes

Concurrency Level:      100
Time taken for tests:   2.281 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      244000 bytes
HTML transferred:       67000 bytes
Requests per second:    438.33 [#/sec] (mean)
Time per request:       228.139 [ms] (mean)
Time per request:       2.281 [ms] (mean, across all concurrent requests)
Transfer rate:          104.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      0       7
Processing:     9  217  49.5    232     275
Waiting:        3  217  49.5    232     275
Total:         10  217  48.4    232     275

Percentage of the requests served within a certain time (ms)
  50%    232
  66%    246
  75%    252
  80%    256
  90%    262
  95%    267
  98%    271
  99%    274
 100%    275 (longest request)