benchmarks/flaskapp-c200-n2000.log
Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /api/pool
Document Length:        67 bytes

Concurrency Level:      200
Time taken for tests:   4.289 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      488000 bytes
HTML transferred:       134000 bytes
Requests per second:    466.35 [#/sec] (mean)
Time per request:       428.863 [ms] (mean)
Time per request:       2.144 [ms] (mean, across all concurrent requests)
Transfer rate:          111.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.5      0      94
Processing:     7  407  93.8    406     520
Waiting:        4  407  93.8    406     520
Total:         19  409  91.8    407     520

Percentage of the requests served within a certain time (ms)
  50%    407
  66%    448
  75%    499
  80%    507
  90%    513
  95%    516
  98%    518
  99%    518
 100%    520 (longest request)